In [1]:
import pandas as pd

In [2]:
data = [1,2,3,4,5,10]
data

[1, 2, 3, 4, 5, 10]

In [3]:
type(data)

list

In [4]:
s = pd.Series(data)
s

0     1
1     2
2     3
3     4
4     5
5    10
dtype: int64

In [5]:
type(s)

pandas.core.series.Series

In [6]:
df = pd.DataFrame(s)
df

    0
0   1
1   2
2   3
3   4
4   5
5  10

In [7]:
df = pd.DataFrame(s, columns=['Numbers'])
df

   Numbers
0        1
1        2
2        3
3        4
4        5
5       10

In [8]:
data

[1, 2, 3, 4, 5, 10]

In [9]:
df1 = pd.DataFrame(data, columns=['Numbers2'])
df1

   Numbers2
0         1
1         2
2         3
3         4
4         5
5        10

In [10]:
s2 = df1['Numbers2']
s2

0     1
1     2
2     3
3     4
4     5
5    10
Name: Numbers2, dtype: int64

In [11]:
type(s2)

pandas.core.series.Series

In [12]:
data = [[1,2], [4,5], [7,8],[10,11]]
data

[[1, 2], [4, 5], [7, 8], [10, 11]]

In [13]:
df = pd.DataFrame(data, columns=['Numbers1', 'Numbers2'])
df

   Numbers1  Numbers2
0         1         2
1         4         5
2         7         8
3        10        11

In [14]:
s = df[['Numbers1', 'Numbers2']]
s

   Numbers1  Numbers2
0         1         2
1         4         5
2         7         8
3        10        11

In [15]:
# Dictionary to DataFrame and Series
data = {
    'Name' :['A', 'B', 'C', 'D'],
    'age' : [10, 20, 30, 40],
    'city' : ['Pune', 'Mumbai', 'Delhi', 'Chennai']
}
data

{'Name': ['A', 'B', 'C', 'D'],
 'age': [10, 20, 30, 40],
 'city': ['Pune', 'Mumbai', 'Delhi', 'Chennai']}

In [16]:
df = pd.DataFrame(data)
df

  Name  age     city
0    A   10     Pune
1    B   20   Mumbai
2    C   30    Delhi
3    D   40  Chennai

In [17]:
series = pd.Series(data['Name'])
series

0    A
1    B
2    C
3    D
dtype: object

In [18]:
series = pd.Series(data['Name'], name='Name')
series

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [19]:
df

  Name  age     city
0    A   10     Pune
1    B   20   Mumbai
2    C   30    Delhi
3    D   40  Chennai

In [20]:
age_series = df['age']
age_series

0    10
1    20
2    30
3    40
Name: age, dtype: int64

In [21]:
# Set to DataFrame and Series
s1 = {1,2,3,4,8,9,6}
s1

{1, 2, 3, 4, 6, 8, 9}

In [22]:
type(s1)

set

In [23]:
s = pd.Series(list(s1))
s

0    1
1    2
2    3
3    4
4    6
5    8
6    9
dtype: int64

In [24]:
type(s)

pandas.core.series.Series

In [25]:
df = pd.DataFrame(s1, columns=['Set Values'])
df

   Set Values
0           1
1           2
2           3
3           4
4           6
5           8
6           9

In [26]:
# tuple to DataFrame and Series
t = (1,2,3,4,5,6)
s = pd.Series(t)
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [27]:
df = pd.DataFrame(t, columns=['Tuple Values'])
df

   Tuple Values
0             1
1             2
2             3
3             4
4             5
5             6

In [28]:
# data types 
# int8= -128 to +128, 
# int16 , int32, int64
# creating a dataframe with integer values

data = {
    'Name':['Tom', 'Nick', 'John', 'Sam'],
    'Age': [25, 24, 28, 30],
    'Salary ($)': [10000, 20000, 30000, 40000],
    'Working Place': ['Pune', 'Mumbai', 'Delhi', 'Chennai'],
    'Country': ['India', 'USA', 'UK', 'Australia']
}
df = pd.DataFrame(data)
df

   Name  Age  Salary ($) Working Place    Country
0   Tom   25       10000          Pune      India
1  Nick   24       20000        Mumbai        USA
2  John   28       30000         Delhi         UK
3   Sam   30       40000       Chennai  Australia

In [29]:
df.dtypes

Name             object
Age               int64
Salary ($)        int64
Working Place    object
Country          object
dtype: object

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           4 non-null      object
 1   Age            4 non-null      int64
 2   Salary ($)     4 non-null      int64
 3   Working Place  4 non-null      object
 4   Country        4 non-null      object
dtypes: int64(2), object(3)
memory usage: 292.0+ bytes

In [31]:
df.max()

Name               Tom
Age                 30
Salary ($)       40000
Working Place     Pune
Country            USA
dtype: object

In [32]:
df['Age'] = df['Age'].astype('int32')
df['Salary ($)'] = df['Salary ($)'].astype('int32')
df

   Name  Age  Salary ($) Working Place    Country
0   Tom   25       10000          Pune      India
1  Nick   24       20000        Mumbai        USA
2  John   28       30000         Delhi         UK
3   Sam   30       40000       Chennai  Australia

In [33]:
df.dtypes

Name             object
Age               int32
Salary ($)        int32
Working Place    object
Country          object
dtype: object

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           4 non-null      object
 1   Age            4 non-null      int32
 2   Salary ($)     4 non-null      int32
 3   Working Place  4 non-null      object
 4   Country        4 non-null      object
dtypes: int32(2), object(3)
memory usage: 260.0+ bytes

In [35]:
2**32

4294967296

In [36]:
4294967296/2

2147483648.0

In [37]:
# object Datetime Datatype
data ={
    'Name':['Tom', 'Nick', 'John', 'Sam'],
    'Age': [25, 24, 28, 30],
    'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Lawyer'],
    'Salary ($)': [10000, 20000, 30000, 40000],
    'Country': ['India', 'USA', 'UK', 'Australia'],
    'City': ['Pune', 'Mumbai', 'Delhi', 'Chennai']
}

data

{'Name': ['Tom', 'Nick', 'John', 'Sam'],
 'Age': [25, 24, 28, 30],
 'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Lawyer'],
 'Salary ($)': [10000, 20000, 30000, 40000],
 'Country': ['India', 'USA', 'UK', 'Australia'],
 'City': ['Pune', 'Mumbai', 'Delhi', 'Chennai']}

In [38]:
df = pd.DataFrame(data)
df

   Name  Age Occupation  Salary ($)    Country     City
0   Tom   25   Engineer       10000      India     Pune
1  Nick   24     Doctor       20000        USA   Mumbai
2  John   28    Teacher       30000         UK    Delhi
3   Sam   30     Lawyer       40000  Australia  Chennai

In [39]:
print(df.dtypes)

Name          object
Age            int64
Occupation    object
Salary ($)     int64
Country       object
City          object
dtype: object

In [40]:
# Datetime
dates = ['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04']

df1 = pd.DataFrame({'Date': dates})
df1['Date'].dtype

dtype('O')

In [41]:
timestamps = pd.to_datetime(dates)
df2 = pd.DataFrame({'Date2': timestamps})

In [42]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date2   4 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 164.0 bytes

In [50]:
# %pip install openpyxl

df = pd.read_excel('data.xlsx')
df.index = range(1, len(df)+1)
df

   Age  Income
1   20   40000
2   27   50000
3   25   52000
4   40   60000
5   50   75000
6   22   45000

In [48]:
df = pd.read_excel('data.xlsx', sheet_name='Sheet2')
df.index = range(1, len(df) + 1)
df

   Roll  Marks
1     1     18
2     2     19
3     3     14
4     4     15
5     5     16

In [51]:
# Path to the Excel file
excel_file = 'data.xlsx'

# Read the Excel file into a Pandas DataFrame
df = pd.read_excel(excel_file)

# Save the DataFrame to a CSV file
csv_file = 'data.csv'
df.to_csv(csv_file, index=False)  # index=False prevents writing row numbers

print(f"Excel file has been converted to {csv_file}")

Excel file has been converted to data.csv

In [53]:
df = pd.read_csv('data.csv')
df.index = range(1, len(df)+1)
df

   Age  Income
1   20   40000
2   27   50000
3   25   52000
4   40   60000
5   50   75000
6   22   45000

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 1 to 6
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     6 non-null      int64
 1   Income  6 non-null      int64
dtypes: int64(2)
memory usage: 228.0 bytes

In [ ]:
# csv nedd minimum memory requirement